; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s2-p2-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 
          t0 t1 t2 t3 t4 t5 t6 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 
          p0 p1 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l0-0)
    (at t5 l3-1)
    (at t6 l3-0)
    (at p0 l1-0)
    (at p1 l3-1)
    (at a0 l0-0)
    (at a1 l3-0)
    (at a2 l2-0)
    (at a3 l3-0)
)
(:goal
    (and
        (at p0 l2-1)
        (at p1 l2-0)
    )
)
)

; plan
1. (load-truck p1 t5 l3-1)
   deleted: (at p1 l3-1)
   added: (in p1 t5)
   goals met: 0 of 2
2. (drive-truck t5 l3-1 l3-0 c3)
   deleted: (at t5 l3-1)
   added: (at t5 l3-0)
   goals met: 0 of 2
3. (unload-truck p1 t5 l3-0)
   deleted: (in p1 t5)
   added: (at p1 l3-0)
   goals met: 0 of 2
4. (load-airplane p1 a1 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 a1)
   goals met: 0 of 2
5. (fly-airplane a1 l3-0 l1-0)
   deleted: (at a1 l3-0)
   added: (at a1 l1-0)
   goals met: 0 of 2
6. (load-airplane p0 a1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 0 of 2
7. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 0 of 2
8. (unload-airplane p0 a1 l2-0)
   deleted: (in p0 a1)
   added: (at p0 l2-0)
   goals met: 0 of 2
9. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 0 of 2
10. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 2
11. (unload-airplane p1 a1 l2-0)
   deleted: (in p1 a1)
   added: (at p1 l2-0)
   goals met: 1 of 2
12. (unload-truck p0 t2 l2-1)
   deleted: (in p0 t2)
   added: (at p0 l2-1)
   goals met: 2 of 2
